Revit 2020 API
Water Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Water
Visual Basic
Public NotInheritable Class Water
Visual C++
public ref class Water abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Water
See Also
Water Members
Autodesk.Revit.DB.Visual Namespace